#include <stdio.h>

int main(void){
    //다차원 배열 Multidimension Array
    
    //1차원 배열
    int arr[5] = {1,2,3,4,5};

    //2차원 배열
    int arr[2][5] = {
        {1,2,3,4,5}, 
        {1,2,3,4,5}
    };

    //3차원 배열
    int arr[3][3][2] = {
        {
            {1,2},
            {1,2},
            {1,2}
        },
        {
            {1,2},
            {1,2},
            {1,2}
            },
        {
            {1,2},
            {1,2},
            {1,2}
        }
    };


    return 0;
}